Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.SurfaceResolutionOutOfRange Property
 Pixel size is out of range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SurfaceResolutionOutOfRange { get; }
Visual Basic
Public Shared ReadOnly Property SurfaceResolutionOutOfRange As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SurfaceResolutionOutOfRange {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace